Repository: furiyamvp/Kino_Bot
Catalog: locale/*/LC_MESSAGES/lang.po
Languages: ru, uz

source: select any language to change the language
ru: выберите любой язык, чтобы изменить язык

source: You have not subscribed to the channels! After subscribing, press /start to activate the bot.
ru: Вы не подписаны на каналы!
uz: Siz kanallarga obuna bo'lmagansiz! Obuna bo'lgandan so'ng, botni faollashtirish uchun /start tugmasini bosing.

source: You are currently using this language
ru: В настоящее время вы используете этот язык
uz: Siz hozir ushbu tildan foydalanyapsiz

source: The language has changed click /start for the bot
ru: Язык изменился
uz: Til oʻzgardi bot uchun / start tugmasini bosing

source: Welcome to the Telegram Bot
ru: Добро пожаловать в Telegram-бот
uz: Telegram botiga xush kelibsiz

source: This bot is the bot of the Zangora Ekran channel. In this bot, if you send us the link of the movie you saw on Instagram, we will send you that movie For the bot to start, click /start
ru: Этот бот - бот канала Zangora Ekran(Зангора Экран). В этом боте, если выфильм Для запуска бота нажмите /start
uz: Bu bot Zangora Ekran kanalining boti. Bu botda agar siz Instagramda ko'rgan filmingizning havolasini bizga yuboring, biz sizga yuboramizfilm Botni ishga tushirish uchun /start" tugmasini bosing

source: There is an error in the bot, please contact us
ru: В боте ошибка, свяжитесь с нами.
uz: Botda xatolik bor, iltimos biz bilan bog'laning

source: Please upload the movie to the bot
ru: Пожалуйста, загрузите фильм в бот
uz: Iltimos, filmni botga yuklang

source: Please enter a movie title. Example: Harry Potter
ru: Пожалуйста, введите название фильма.

source: You can only upload videos, you cannot upload anything in text format.
ru: Вы можете загружать только видео, в текстовом формате ничего загружать нельзя.
uz: Siz faqat videolarni yuklashingiz mumkin, matn formatida hech narsa yuklay olmaysiz.

source: Please enter year the movie was released Example: 2024
ru: Пожалуйста, укажите год выхода фильма
uz: Film chiqqan yilni kiriting Misol: 2024

source: Please do not use numbers
ru: Пожалуйста, не используйте цифры
uz: Iltimos, raqamlardan foydalanmang

source: Please enter the movie type Example: Fight
ru: Пожалуйста, введите тип фильма
uz: Film turini kiriting Misol: Jang

source: Please do not use letter
ru: Пожалуйста, не используйте букву
uz: Iltimos, harf ishlatmang

source: you can only enter an instagram link
ru: вы можете ввести только ссылку Instagram
uz: siz faqat instagram havolasini kiritishingiz mumkin

source: Please enter film's link on tiktok Example: https://www.youtube.com/******
ru: Пример: https://www.youtube.com/******
uz: Iltimos, tiktokda film havolasini kiriting Masalan: https://www.youtube.com/******

source: you can only enter an tiktok link
ru: вы можете ввести только ссылку на тикток
uz: siz faqat tiktok havolasini kiritishingiz mumkin

source: Please enter movie status Example: Free or Premium
ru: Пожалуйста, введите статус фильма
uz: Iltimos, film holatini kiriting Misol: Bepul yoki Premium

source: Movie added. ✅
ru: Фильм добавлен. ✅
uz: Film qo'shildi. ✅

source: 🆔Film's code: {code} 🎬Name: {name} ➖➖➖➖➖➖➖➖➖➖ 📀Quality: {quality} 🌍State: {state} 📅Date: {date}-year 🎞️Type: {type} 💜Instagram: {instagram} 🖤Tiktok: {tiktok} ❤️You Tube: {you_tube}
ru: 🆔Код фильма: {code} 🎬Имя: {name} ➖➖➖➖➖➖➖➖➖➖ 📀Качество: {quality} 🌍Состояние: {state} 📅Дата: {date}-год 🎞️Тип: {type} 💜Инстаграм: {instagram} 🖤Тикток: {tiktok} ❤️YouTube: {you_tube}
uz: 🆔Film kodi: {code} 🎬Ism: {name} ➖➖➖➖➖➖➖➖➖➖ 📀Sifat: {quality} 🌍Davlati: {state} 📅Sana: {date}-yil 🎞️Turi: {type} 💜Instagram: {instagram} 🖤Tiktok: {tiktok} ❤️You Tube: {you_tube}

source: There is an error in adding a movie. ❌
ru: Произошла ошибка при добавлении фильма. ❌
uz: Film qo‘shishda xatolik yuz berdi. ❌

source: Welcome to the main menu
ru: Добро пожаловать в главное меню
uz: Asosiy menyuga xush kelibsiz

source: Please enter user chat id
ru: Пожалуйста, введите идентификатор пользователя в чате
uz: Iltimos, foydalanuvchi chat id sini kiriting

source: Id: {id} Chat id: {chat_id} Status: {status}
ru: Ид {id} Чат ид: {chat_id} Статус: {status}
uz: Id: {id} Chat id: {chat_id} Holat: {status}

source: User's status has changed
ru: Статус пользователя изменился
uz: Foydalanuvchining holati o'zgardi

source: 🎬Name: {name} ➖➖➖➖➖➖➖➖➖➖ 📀quality: {quality} 🌍state: {state} 📅Date: {date}-year 🎞️type: {type} 💜Instagram: {instagram} 🖤Tiktok: {tiktok} ❤️You Tube: {you_tube} 🧩Our Chanel: @Zangoriekran_kanali
ru: 🆔Код фильма: {code} 🎬Имя: {name} ➖➖➖➖➖➖➖➖➖➖ 📀Качество: {quality} 🌍Состояние: {state} 📅Дата: {date}-год 🎞️Тип: {type} 💜Инстаграм: {instagram} 🖤Тикток: {tiktok} ❤️YouTube: {you_tube} 🧩Наш канал: @Zangoriekran_kanali
uz: 🆔Film kodi: {code} 🎬Ism: {name} ➖➖➖➖➖➖➖➖➖➖ 📀Sifat: {quality} 🌍Davlati: {state} 📅Sana: {date}-yil 🎞️Turi: {type} 💜Instagram: {instagram} 🖤Tiktok: {tiktok} ❤️You Tube: {you_tube} 🧩Bizni kanalimiz: @Zangoriekran_kanali

source: There is no movie with that link❗️
ru: По этой ссылке нет фильма❗️
uz: Bu havola bilan film yo'q❗️

source: There is no movie with that link ❗️
ru: По этой ссылке нет фильма ❗️
uz: Bu havola bilan film yo'q❗️

source: Film changed 🔄
ru: Фильм изменился 🔄
uz: Film o'zgartirildi 🔄

source: An error occurred while changing the movie 🔄❌
ru: Произошла ошибка при смене фильма 🔄❌
uz: Filmni o'zgartirishda xatolik yuz berdi 🔄❌

source: Please enter a new film name
ru: Пожалуйста, введите новое название фильма
uz: Iltimos, yangi film nomini kiriting

source: Film's name changed 🔄
ru: Название фильма изменено 🔄
uz: Film nomi o'zgartirildi 🔄

source: An error occurred while renaming the movie 🔄❌
ru: При переименовании фильма произошла ошибка 🔄❌
uz: Film nomini oʻzgartirishda xatolik yuz berdi 🔄❌

source: Please enter a new film state
ru: Пожалуйста, введите новый статус фильма
uz: Iltimos, yangi film holatini kiriting

source: Film's state changed 🔄
ru: Статус фильма изменилось 🔄
uz: Filmning holati o'zgardi 🔄

source: Error: Film's didn't state change 🔄❌
ru: Ошибка: статус фильма не изменена 🔄❌
uz: Xato: filmda oʻzgarish koʻrsatilmagan 🔄❌

source: Film's date changed 🔄
ru: Дата выхода фильма изменена 🔄
uz: Filmning sanasi o'zgardi 🔄

source: Error: Film's didn't date change 🔄❌
ru: Ошибка: дата фильма не изменена 🔄❌
uz: Xato: filmning sanasi oʻzgarmagan 🔄❌

source: Please enter a new film type
ru: Пожалуйста, введите новый тип пленки
uz: Iltimos, yangi film turini kiriting

source: Film's type changed 🔄
ru: Тип фильма изменен 🔄
uz: Film turi o'zgardi 🔄

source: Error: Film's didn't type change 🔄❌
ru: Ошибка: тип фильма не изменен 🔄❌
uz: Xato: filmda matn turi oʻzgarmadi 🔄❌

source: Please enter a new film instagram link
ru: Пожалуйста, введите ссылку на новый фильм в Instagram
uz: Iltimos, yangi film instagram havolasini kiriting

source: Film's instagram link changed 🔄
ru: Ссылка на фильм в инстаграме изменена 🔄
uz: Filmning instagramdagi havolasi o'zgartirildi 🔄

source: Error: Film's didn't instagram link change 🔄❌
ru: Ошибка: ссылка на фильм в Instagram не изменилась 🔄❌
uz: Xato: Filmda instagram havolasi oʻzgarmadi 🔄❌

source: You can only enter an instagram link
ru: Вы можете ввести только ссылку Instagram
uz: Siz faqat instagram havolasini kiritishingiz mumkin

source: Please enter a new film tiktok link
ru: Пожалуйста, введите ссылку на новый фильм в тикток
uz: Iltimos, yangi film tiktok havolasini kiriting

source: Film's tiktok link changed 🔄
ru: Ссылка на фильм в тиктоке изменена 🔄
uz: Filmning tiktok havolasi o'zgartirildi 🔄

source: Error: Film's didn't tiktok link change 🔄❌
ru: Ошибка: ссылка на фильм в тиктоке не изменилась 🔄❌
uz: Xato: Filmda tiktok havolasi oʻzgarmadi 🔄❌

source: You can only enter an tiktok link
ru: Вы можете ввести только ссылку на тикток
uz: Siz faqat tiktok havolasini kiritishingiz mumkin

source: Please enter a new film you tube link
ru: Пожалуйста, введите ссылку на новый фильм на YouTube
uz: Iltimos, yangi film you tube havolasini kiriting

source: Film's you tube link changed 🔄
ru: Ссылка на YouTube фильма изменена 🔄
uz: Filmning you tube havolasi o'zgartirildi 🔄

source: Error: Film's didn't you tube link change 🔄❌
ru: Ошибка: ссылка на фильм не была изменена вами на тюбе 🔄❌
uz: Xato: Filmning havolasi oʻzgardi 🔄❌

source: You can only enter an you tube link
ru: Вы можете ввести только ссылку на YouTube
uz: Siz faqat you tube havolasini kiritishingiz mumkin

source: The film has been deleted 🔄
ru: Фильм удален 🔄
uz: Film o'chirildi 🔄

source: There is an error while deleting the movie 🗑❌
ru: При удалении фильма произошла ошибка 🗑❌
uz: Filmni oʻchirishda xatolik yuz berdi 🗑❌

source: Welcome to the settings menu
ru: Добро пожаловать в меню настроек
uz: Sozlamalar menyusiga xush kelibsiz

source: Hello Admin🫡
ru: Привет Админ🫡
uz: Salom Admin🫡

source: Welcome to the statistics menu
ru: Добро пожаловать в меню статистики
uz: Statistika menyusiga xush kelibsiz

source: Requirements: The movie you are looking for must be available, do not use offensive language, and your message must not exceed 100 characters. Reminder. If you say something bad, we will remove your bonus.
ru: «Требования: фильм, который вы ищете, должен быть доступен, не используйтенецензурная лексика. Ваше сообщение не должно превышать 100 символов.
uz: Talablar: Siz izlayotgan film mavjud bo'lishi kerak, foydalanmang haqoratomuz til va xabaringiz 100 belgidan oshmasligi kerak. Eslatma. Agar yomon gapirsangiz, bonusingizni olib tashlaymiz.

source: Your message has exceeded 100 characters, you used {len} characters in your message
ru: Ваше сообщение превысило 100 символов, вы использовали {len} символов в Ваше сообщение
uz: Xatingiz 100 ta belgidan oshdi, siz "{len} ta belgidan foydalandingizxabaringiz

source: There is no movie with that code ❗️
ru: Фильма с таким кодом нет ❗️
uz: Bunday kodli film yo'q ❗️

source: Statistics 📊
ru: Статистика 📊
uz: Statistika 📊

source: Settings ⚙️
ru: Настройки ⚙️
uz: Sozlamalar ⚙️

source: Giving premium 💎
ru: Дать премиум 💎
uz: Premium berish 💎

source: Add Film ➕
ru: Добавить фильм ➕
uz: Film qo'shish ➕

source: Quantity users 👥
ru: Количество пользователей 👥
uz: Foydalanuvchilar soni 👥

source: Quantity films 🎥
ru: Количественные фильмы 🎥
uz: Filmlar soni 🎥

source: Back ⬅️
ru: Назад ⬅️
uz: Orqaga ⬅️

source: Change language 🇺🇿🇷🇺🇺🇸
ru: Сменить язык 🇺🇿🇷🇺🇺🇸
uz: Tilni o'zgartirish 🇺🇿🇷🇺🇺🇸

source: Call center 📞
ru: Колл-центр 📞

source: Order a movie 🛍🎥
ru: Заказать фильм 🛍🎥
uz: Filmga buyurtma bering 🛍🎥

source: Free 🆓
ru: Бесплатно 🆓
uz: Bepul 🆓

source: Premium 💎
ru: Премиум 💎

source: Film 🎥
ru: Фильм 🎥

source: Name 🎬
ru: Имя
uz: Ism 🎬

source: State 🌏
ru: Страна 🌏
uz: Davlat 🌏

source: Date 📅
ru: Дата 📅
uz: Sana 📅

source: Type 🎞️
ru: Наберите 🎞️
uz: Yozing 🎞️

source: Delete 🗑
ru: Удалить 🗑
uz: O'chirish 🗑

source: Change free 🆓
ru: Меняем бесплатно 🆓
uz: Bepul almashtiring 🆓

source: Change premium 💎
ru: Сменить премиум 💎

source: ✅ SUBSCRIBE
ru: ✅ ПОДПИСАТЬСЯ
uz: ✅ OBUNA BO'LING

source: Please enter the country in which the movie was released Example: USA
uz: Iltimos, film qaysi mamlakatda chiqarilganligini kiriting Misol: AQSh

source: Please enter film's link on instagram Example: https://www.instagram.com/******
uz: Iltimos, filmning instagramdagi havolasini kiriting Misol: https://www.instagram.com/******

source: Please enter film's link on tiktok Example: https://vt.tiktok.com/******
uz: Iltimos, tiktokda film havolasini kiriting Misol: https://vt.tiktok.com/******

source: Please enter a new film date
uz: Iltimos, yangi film sanasini kiriting
